# FilteredWorksetCollector Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredWorksetCollector Properties
FilteredWorksetCollector Class See Also
---
The FilteredWorksetCollector type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace